import joblib
from sklearn.ensemble import RandomForestClassifier

# ==============================
# FEATURE ORDER (30 ตัว)
# ==============================
# [
#  0 cough,
#  1 heavycough,
#  2 tired,
#  3 feverlittle,
#  4 feverbig,
#  5 sore_throat,
#  6 chestpain,
#  7 chest,
#  8 tightchest,
#  9 breath,
# 10 breathtired,
# 11 breathfast,
# 12 wheezing,
# 13 runny_nose,
# 14 sneeze,
# 15 bodyaches,
# 16 weight,
# 17 panting,
# 18 swallow,
# 19 phlegm,
# 20 headache,
# 21 chronic_cough,
# 22 aqi_bad,
# 23 sad,
# 24 nausea,
# 25 diarrhea,
# 26 loss_smell,
# 27 red_eyes,
# 28 skin_rash,
# 29 finger_color
# ]

X = [

# 0 หวัด
[1,0,0,1,1,0,1,0,0,0,0,0,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0],

# 1 ไข้หวัดใหญ่
[1,0,1,1,0,1,1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0],

# 2 ปอดอักเสบ
[1,0,1,1,0,1,0,1,0,1,1,1,1,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,0],

# 3 หลอดลมอักเสบ
[1,0,1,1,1,0,0,0,1,0,1,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0],

# 4 หอบหืด
[0,0,0,1,0,0,0,0,0,1,1,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0],

# 5 วัณโรค
[1,1,1,1,0,1,0,0,0,0,1,1,0,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0],

# 6 ทอนซิลอักเสบ
[0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0],

# 7 ระคายเคืองจากฝุ่น
[1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0],

# 8 ไซนัสอักเสบ
[0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0],

# 9 COPD
[0,1,0,1,0,0,0,0,0,0,1,0,0,1,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,0],

# 10 ถุงลมโป่งพอง
[1,1,0,1,0,0,0,0,0,1,1,1,0,1,0,0,0,1,1,0,1,0,0,0,0,0,0,0,0,0],

# 11 หลอดลมโป่งพอง
[1,1,1,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,0],

# 12 COVID-19
[1,0,1,1,0,1,1,0,0,0,1,0,0,0,1,0,1,0,0,0,1,1,0,1,1,1,1,1,1,1]
]

y = list(range(13))

model = RandomForestClassifier(
    n_estimators=400,
    max_depth=7,
    random_state=42
)

model.fit(X, y)
joblib.dump(model, "disease_model.pkl")

print("✅ Train respiratory model สำเร็จ")